{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "795f6c96",
   "metadata": {},
   "source": [
    "# Building a local Knowledge Graph RAG with Neo4j, LangChain, and Ollama"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ffd7fd59",
   "metadata": {},
   "source": [
    "## Preliminary: \n",
    "### Installs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "00f37ad8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Python 3.12.3\n",
      "Requirement already satisfied: langchain==1.2.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 2)) (1.2.0)\n",
      "Requirement already satisfied: langchain-core==1.2.2 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 3)) (1.2.2)\n",
      "Requirement already satisfied: langchain-classic==1.0.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 4)) (1.0.0)\n",
      "Requirement already satisfied: langchain-community==0.4.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 7)) (0.4)\n",
      "Requirement already satisfied: langchain-text-splitters==1.0.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 8)) (1.0.0)\n",
      "Requirement already satisfied: langchain-experimental==0.4.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 9)) (0.4.1)\n",
      "Requirement already satisfied: langchain-neo4j==0.6.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 10)) (0.6.0)\n",
      "Requirement already satisfied: langchain-ollama==1.0.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 11)) (1.0.1)\n",
      "Requirement already satisfied: neo4j==5.25.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 14)) (5.25.0)\n",
      "Requirement already satisfied: wikipedia==1.4.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 15)) (1.4.0)\n",
      "Requirement already satisfied: python-dotenv==1.0.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 16)) (1.0.1)\n",
      "Requirement already satisfied: pydantic<3 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from -r requirements.txt (line 17)) (2.12.5)\n",
      "Requirement already satisfied: langgraph<1.1.0,>=1.0.2 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain==1.2.0->-r requirements.txt (line 2)) (1.0.5)\n",
      "Requirement already satisfied: jsonpatch<2.0.0,>=1.33.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-core==1.2.2->-r requirements.txt (line 3)) (1.33)\n",
      "Requirement already satisfied: langsmith<1.0.0,>=0.3.45 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-core==1.2.2->-r requirements.txt (line 3)) (0.5.0)\n",
      "Requirement already satisfied: packaging<26.0.0,>=23.2.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-core==1.2.2->-r requirements.txt (line 3)) (25.0)\n",
      "Requirement already satisfied: pyyaml<7.0.0,>=5.3.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-core==1.2.2->-r requirements.txt (line 3)) (6.0.3)\n",
      "Requirement already satisfied: tenacity!=8.4.0,<10.0.0,>=8.1.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-core==1.2.2->-r requirements.txt (line 3)) (9.1.2)\n",
      "Requirement already satisfied: typing-extensions<5.0.0,>=4.7.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-core==1.2.2->-r requirements.txt (line 3)) (4.15.0)\n",
      "Requirement already satisfied: uuid-utils<1.0,>=0.12.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-core==1.2.2->-r requirements.txt (line 3)) (0.12.0)\n",
      "Requirement already satisfied: requests<3.0.0,>=2.0.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-classic==1.0.0->-r requirements.txt (line 4)) (2.32.5)\n",
      "Requirement already satisfied: sqlalchemy<3.0.0,>=1.4.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-classic==1.0.0->-r requirements.txt (line 4)) (2.0.45)\n",
      "Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-community==0.4.0->-r requirements.txt (line 7)) (3.13.2)\n",
      "Requirement already satisfied: dataclasses-json<0.7.0,>=0.6.7 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-community==0.4.0->-r requirements.txt (line 7)) (0.6.7)\n",
      "Requirement already satisfied: pydantic-settings<3.0.0,>=2.10.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-community==0.4.0->-r requirements.txt (line 7)) (2.12.0)\n",
      "Requirement already satisfied: httpx-sse<1.0.0,>=0.4.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-community==0.4.0->-r requirements.txt (line 7)) (0.4.3)\n",
      "Requirement already satisfied: numpy>=1.26.2 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-community==0.4.0->-r requirements.txt (line 7)) (2.3.5)\n",
      "Requirement already satisfied: neo4j-graphrag<2.0.0,>=1.9.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-neo4j==0.6.0->-r requirements.txt (line 10)) (1.10.1)\n",
      "Requirement already satisfied: pytz in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from neo4j==5.25.0->-r requirements.txt (line 14)) (2025.2)\n",
      "Requirement already satisfied: ollama<1.0.0,>=0.6.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langchain-ollama==1.0.1->-r requirements.txt (line 11)) (0.6.1)\n",
      "Requirement already satisfied: beautifulsoup4 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from wikipedia==1.4.0->-r requirements.txt (line 15)) (4.14.3)\n",
      "Requirement already satisfied: annotated-types>=0.6.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from pydantic<3->-r requirements.txt (line 17)) (0.7.0)\n",
      "Requirement already satisfied: pydantic-core==2.41.5 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from pydantic<3->-r requirements.txt (line 17)) (2.41.5)\n",
      "Requirement already satisfied: typing-inspection>=0.4.2 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from pydantic<3->-r requirements.txt (line 17)) (0.4.2)\n",
      "Requirement already satisfied: aiohappyeyeballs>=2.5.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community==0.4.0->-r requirements.txt (line 7)) (2.6.1)\n",
      "Requirement already satisfied: aiosignal>=1.4.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community==0.4.0->-r requirements.txt (line 7)) (1.4.0)\n",
      "Requirement already satisfied: attrs>=17.3.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community==0.4.0->-r requirements.txt (line 7)) (25.4.0)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community==0.4.0->-r requirements.txt (line 7)) (1.8.0)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community==0.4.0->-r requirements.txt (line 7)) (6.7.0)\n",
      "Requirement already satisfied: propcache>=0.2.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community==0.4.0->-r requirements.txt (line 7)) (0.4.1)\n",
      "Requirement already satisfied: yarl<2.0,>=1.17.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain-community==0.4.0->-r requirements.txt (line 7)) (1.22.0)\n",
      "Requirement already satisfied: marshmallow<4.0.0,>=3.18.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from dataclasses-json<0.7.0,>=0.6.7->langchain-community==0.4.0->-r requirements.txt (line 7)) (3.26.1)\n",
      "Requirement already satisfied: typing-inspect<1,>=0.4.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from dataclasses-json<0.7.0,>=0.6.7->langchain-community==0.4.0->-r requirements.txt (line 7)) (0.9.0)\n",
      "Requirement already satisfied: jsonpointer>=1.9 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from jsonpatch<2.0.0,>=1.33.0->langchain-core==1.2.2->-r requirements.txt (line 3)) (3.0.0)\n",
      "Requirement already satisfied: langgraph-checkpoint<4.0.0,>=2.1.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (3.0.1)\n",
      "Requirement already satisfied: langgraph-prebuilt<1.1.0,>=1.0.2 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (1.0.5)\n",
      "Requirement already satisfied: langgraph-sdk<0.4.0,>=0.3.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (0.3.0)\n",
      "Requirement already satisfied: xxhash>=3.5.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (3.6.0)\n",
      "Requirement already satisfied: ormsgpack>=1.12.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langgraph-checkpoint<4.0.0,>=2.1.0->langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (1.12.1)\n",
      "Requirement already satisfied: httpx>=0.25.2 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langgraph-sdk<0.4.0,>=0.3.0->langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (0.28.1)\n",
      "Requirement already satisfied: orjson>=3.10.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langgraph-sdk<0.4.0,>=0.3.0->langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (3.11.5)\n",
      "Requirement already satisfied: requests-toolbelt>=1.0.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core==1.2.2->-r requirements.txt (line 3)) (1.0.0)\n",
      "Requirement already satisfied: zstandard>=0.23.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from langsmith<1.0.0,>=0.3.45->langchain-core==1.2.2->-r requirements.txt (line 3)) (0.25.0)\n",
      "Requirement already satisfied: anyio in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from httpx>=0.25.2->langgraph-sdk<0.4.0,>=0.3.0->langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (4.12.0)\n",
      "Requirement already satisfied: certifi in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from httpx>=0.25.2->langgraph-sdk<0.4.0,>=0.3.0->langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (2025.11.12)\n",
      "Requirement already satisfied: httpcore==1.* in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from httpx>=0.25.2->langgraph-sdk<0.4.0,>=0.3.0->langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (1.0.9)\n",
      "Requirement already satisfied: idna in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from httpx>=0.25.2->langgraph-sdk<0.4.0,>=0.3.0->langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (3.11)\n",
      "Requirement already satisfied: h11>=0.16 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from httpcore==1.*->httpx>=0.25.2->langgraph-sdk<0.4.0,>=0.3.0->langgraph<1.1.0,>=1.0.2->langchain==1.2.0->-r requirements.txt (line 2)) (0.16.0)\n",
      "Requirement already satisfied: fsspec<2025.0.0,>=2024.9.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from neo4j-graphrag<2.0.0,>=1.9.0->langchain-neo4j==0.6.0->-r requirements.txt (line 10)) (2024.12.0)\n",
      "Requirement already satisfied: json-repair<0.45.0,>=0.44.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from neo4j-graphrag<2.0.0,>=1.9.0->langchain-neo4j==0.6.0->-r requirements.txt (line 10)) (0.44.1)\n",
      "Requirement already satisfied: pypdf<7.0.0,>=6.0.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from neo4j-graphrag<2.0.0,>=1.9.0->langchain-neo4j==0.6.0->-r requirements.txt (line 10)) (6.4.2)\n",
      "Requirement already satisfied: scipy<2.0.0,>=1.13.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from neo4j-graphrag<2.0.0,>=1.9.0->langchain-neo4j==0.6.0->-r requirements.txt (line 10)) (1.16.3)\n",
      "Requirement already satisfied: types-pyyaml<7.0.0.0,>=6.0.12.20240917 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from neo4j-graphrag<2.0.0,>=1.9.0->langchain-neo4j==0.6.0->-r requirements.txt (line 10)) (6.0.12.20250915)\n",
      "Requirement already satisfied: charset_normalizer<4,>=2 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from requests<3.0.0,>=2.0.0->langchain-classic==1.0.0->-r requirements.txt (line 4)) (3.4.4)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from requests<3.0.0,>=2.0.0->langchain-classic==1.0.0->-r requirements.txt (line 4)) (2.6.2)\n",
      "Requirement already satisfied: mypy-extensions>=0.3.0 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7.0,>=0.6.7->langchain-community==0.4.0->-r requirements.txt (line 7)) (1.1.0)\n",
      "Requirement already satisfied: soupsieve>=1.6.1 in /Users/alienorsabourdin/.pyenv/versions/3.12/envs/graphito/lib/python3.12/site-packages (from beautifulsoup4->wikipedia==1.4.0->-r requirements.txt (line 15)) (2.8)\n"
     ]
    }
   ],
   "source": [
    "!python -V\n",
    "!pip install -U -r requirements.txt\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "648b1de8",
   "metadata": {},
   "source": [
    "### Environment variables"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "bd055dde",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from dotenv import load_dotenv\n",
    "load_dotenv()  \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "49dc82cf",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "DIFFBOT_API_KEY: True\n",
      "NEO4J_URI: bolt://localhost:7687\n",
      "NEO4J_DATABASE: shop\n",
      "NEO4J_PASSWORD: password\n",
      "NEO4J_PASSWORD: neo4j\n",
      "OLLAMA_BASE_URL: http://localhost:11434\n",
      "OLLAMA_MODEL: llama3:8b\n",
      ".env loaded correctly\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "\n",
    "\n",
    "DIFFBOT_API_KEY = os.getenv(\"DIFFBOT_API_KEY\")\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_DATABASE = os.getenv(\"NEO4J_DATABASE\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "\n",
    "OLLAMA_BASE_URL = os.getenv(\"OLLAMA_BASE_URL\")\n",
    "OLLAMA_MODEL = os.getenv(\"OLLAMA_MODEL\")\n",
    "\n",
    "print(\"DIFFBOT_API_KEY:\", bool(DIFFBOT_API_KEY))\n",
    "print(\"NEO4J_URI:\", NEO4J_URI)\n",
    "print(\"NEO4J_DATABASE:\", NEO4J_DATABASE)\n",
    "print(\"NEO4J_PASSWORD:\", NEO4J_PASSWORD)\n",
    "print(\"NEO4J_PASSWORD:\", NEO4J_USERNAME)\n",
    "print(\"OLLAMA_BASE_URL:\", OLLAMA_BASE_URL)\n",
    "print(\"OLLAMA_MODEL:\", OLLAMA_MODEL)\n",
    "\n",
    "\n",
    "print(\".env loaded correctly\")\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9d9237cd",
   "metadata": {},
   "source": [
    "## Extract graph content\n",
    "### Load wikipedia documents"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "642290da",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(2,\n",
       " {'title': 'Stray Kids',\n",
       "  'summary': 'Stray Kids (often abbreviated to SKZ; Korean: 스트레이 키즈; RR: Seuteurei Kijeu) is a South Korean boy band formed by JYP Entertainment. The band has eight members: Bang Chan, Lee Know, Changbin, Hyunjin, Han, Felix, Seungmin, and I.N. Former member Woojin left the band in 2019. Stray Kids primarily self-produces its recordings; the main production team is named 3Racha and consists of Bang Chan, Changbin, and Han, and the other members frequently participate in songwriting.\\nThe leader, Bang Chan, personally selected each member to be a part of the band before filming the eponymous 2017 reality television show, which is unusual in K-pop, where that authority is usually held by the agency\\'s executives and creative directors. The band released their unofficial debut extended play (EP) Mixtape in January 2018 and officially debuted on March 25 with the EP I Am Not, which was followed by the EPs I Am Who and I Am You, completing the I Am EP series. The Clé trilogy, consisting of Clé 1: Miroh, Clé 2: Yellow Wood, and Clé: Levanter, was released in 2019.\\nThe band\\'s first studio album, Go Live (2020), became its first platinum-certified album by the Korea Music Content Association (KMCA). That year, Stray Kids made their Japanese debut with the compilation album SKZ2020, which was released through Epic Records Japan. Their debut Japanese single, \"Top\", debuted atop the Oricon Singles Chart, making them the fourth foreign male artist to do so with their first single.\\nIn 2021, Stray Kids\\' second studio album, Noeasy, became its first million-selling album. After signing with Republic Records for promotions in the United States in 2022, the band released their EPs Oddinary, Maxident (both 2022), Rock-Star (2023), and Ate (2024); their studio albums 5-Star (2023) & Karma (2025); and their mixtapes Hop (2024) & Do It (2025). These eight releases peaked at number one on the US Billboard 200, making them the first act to debut at the top of the Billboard 200 with their first eight charted releases. The KMCA certified 5-Star five million in album sales, making Stray Kids the third group to achieve this in Korea. In 2023, the band appeared on Time\\'s list of Next Generation Leaders. As of December 2024, Stray Kids has sold over 31 million albums, both Korean and Japanese releases.\\n\\n',\n",
       "  'source': 'https://en.wikipedia.org/wiki/Stray_Kids'},\n",
       " 'Stray Kids (often abbreviated to SKZ; Korean: 스트레이 키즈; RR: Seuteurei Kijeu) is a South Korean boy band formed by JYP Entertainment. The band has eight members: Bang Chan, Lee Know, Changbin, Hyunjin, Han, Felix, Seungmin, and I.N. Former member Woojin left the band in 2019. Stray Kids primarily self-produces its recordings; the main production team is named 3Racha and consists of Bang Chan, Changbin, and Han, and the other members frequently participate in songwriting.\\nThe leader, Bang Chan, per')"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain_community.document_loaders import WikipediaLoader\n",
    "\n",
    "TOPIC = \"Stray Kids\"   \n",
    "docs = WikipediaLoader(query=TOPIC, load_max_docs=2).load()\n",
    "\n",
    "len(docs), docs[0].metadata, docs[0].page_content[:500]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "50c2403c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(9,\n",
       " 'Stray Kids (often abbreviated to SKZ; Korean: 스트레이 키즈; RR: Seuteurei Kijeu) is a South Korean boy band formed by JYP Entertainment. The band has eight members: Bang Chan, Lee Know, Changbin, Hyunjin, Han, Felix, Seungmin, and I.N. Former member Woojin left the band in 2019. Stray Kids primarily self')"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain_text_splitters import RecursiveCharacterTextSplitter\n",
    "\n",
    "splitter = RecursiveCharacterTextSplitter(chunk_size=1500, chunk_overlap=200)\n",
    "split_docs = splitter.split_documents(docs)\n",
    "len(split_docs), split_docs[0].page_content[:300]\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "239f3a2f",
   "metadata": {},
   "source": [
    "### Extract graphs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "0f37f471",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(9, langchain_community.graphs.graph_document.GraphDocument)"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain_experimental.graph_transformers import DiffbotGraphTransformer\n",
    "\n",
    "if not DIFFBOT_API_KEY:\n",
    "    raise ValueError(\"Missing DIFFBOT_API_KEY env var. Set it locally; do not commit it.\")\n",
    "\n",
    "transformer = DiffbotGraphTransformer(diffbot_api_key=DIFFBOT_API_KEY)\n",
    "\n",
    "graph_docs = transformer.convert_to_graph_documents(split_docs)\n",
    "len(graph_docs), type(graph_docs[0])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "508697b0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([Node(id='http://www.wikidata.org/entity/Q59670293', type='Person', properties={'name': 'Bang Chan'}),\n",
       "  Node(id='http://www.wikidata.org/entity/Q46134670', type='Organization', properties={'name': 'Stray Kids'}),\n",
       "  Node(id='Woojin', type='Person', properties={'name': 'Woojin'})],\n",
       " [Relationship(source=Node(id='http://www.wikidata.org/entity/Q59670293', type='Person', properties={}), target=Node(id='http://www.wikidata.org/entity/Q46134670', type='Organization', properties={}), type='EMPLOYEE_OR_MEMBER_OF', properties={'evidence': 'Stray Kids primarily self-produces its recordings; the main production team is named 3Racha and consists of Bang Chan, Changbin, and Han, and the other members frequently participate in songwriting.', 'isCurrent': 'true'}),\n",
       "  Relationship(source=Node(id='Woojin', type='Person', properties={}), target=Node(id='http://www.wikidata.org/entity/Q46134670', type='Organization', properties={}), type='EMPLOYEE_OR_MEMBER_OF', properties={'evidence': 'Stray Kids primarily self-produces its recordings; the main production team is named 3Racha and consists of Bang Chan, Changbin, and Han, and the other members frequently participate in songwriting.', 'isCurrent': 'true'})])"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Display the graph extracted\n",
    "gd = graph_docs[0]\n",
    "gd.nodes[:5], gd.relationships[:5]\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "854a57cf",
   "metadata": {},
   "source": [
    "## Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cc9300e2",
   "metadata": {},
   "source": [
    "### Connect and build the graphs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "a01cf1bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record name='shop' type='standard' aliases=[] access='read-write' address='localhost:7687' role='primary' writer=True requestedStatus='online' currentStatus='online' statusMessage='' default=True home=True constituents=[]>,\n",
       " <Record name='system' type='system' aliases=[] access='read-write' address='localhost:7687' role='primary' writer=True requestedStatus='online' currentStatus='online' statusMessage='' default=False home=False constituents=[]>]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from neo4j import GraphDatabase\n",
    "\n",
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD))\n",
    "\n",
    "def run_cypher(q, params=None):\n",
    "    params = params or {}\n",
    "    with driver.session(database=NEO4J_DATABASE) as s:\n",
    "        return list(s.run(q, params))\n",
    "\n",
    "# ⚠️ Clean DB\n",
    "run_cypher(\"MATCH (n) DETACH DELETE n\")\n",
    "run_cypher(\"SHOW DATABASES\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2ee27533",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Person {id: STRING, name: STRING}\n",
      "Organization {id: STRING, name: STRING}\n",
      "Location {id: STRING, name: STRING}\n",
      "Relationship properties:\n",
      "EMPLOYEE_OR_MEMBER_OF {evidence: STRING, isCurrent: STRING}\n",
      "WORK_RELATIONSHIP {evidence: STRING}\n",
      "FOUNDED_BY {evidence: STRING}\n",
      "ORGANIZATION_LOCATIONS {evidence: STRING}\n",
      "The relationships:\n",
      "(:Person)-[:EMPLOYEE_OR_MEMBER_OF]->(:Organization)\n",
      "(:Person)-[:WORK_RELATIONSHIP]->(:Person)\n",
      "(:Organization)-[:ORGANIZATION_LOCATIONS]->(:Location)\n",
      "(:Organization)-[:FOUNDED_BY]->(:Person)\n"
     ]
    }
   ],
   "source": [
    "from langchain_neo4j import Neo4jGraph\n",
    "\n",
    "graph = Neo4jGraph(\n",
    "    url=NEO4J_URI,\n",
    "    username=NEO4J_USERNAME,\n",
    "    password=NEO4J_PASSWORD,\n",
    "    database=NEO4J_DATABASE\n",
    ")\n",
    "\n",
    "graph.add_graph_documents(graph_docs)\n",
    "\n",
    "graph.refresh_schema()\n",
    "print(graph.schema)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85a58f2b",
   "metadata": {},
   "source": [
    "### Inspect graphs with cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "8c15e439",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record label='Location'>,\n",
       " <Record label='Organization'>,\n",
       " <Record label='Person'>]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_cypher(\"CALL db.labels() YIELD label RETURN label ORDER BY label\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "49cbb801",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record relationshipType='EMPLOYEE_OR_MEMBER_OF'>,\n",
       " <Record relationshipType='FOUNDED_BY'>,\n",
       " <Record relationshipType='ORGANIZATION_LOCATIONS'>,\n",
       " <Record relationshipType='WORK_RELATIONSHIP'>]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_cypher(\"CALL db.relationshipTypes() YIELD relationshipType RETURN relationshipType ORDER BY relationshipType\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "17a142d6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record labels=['Person'] name='Bang Chan' id='http://www.wikidata.org/entity/Q59670293'>,\n",
       " <Record labels=['Organization'] name='Stray Kids' id='http://www.wikidata.org/entity/Q46134670'>,\n",
       " <Record labels=['Person'] name='Woojin' id='Woojin'>,\n",
       " <Record labels=['Person'] name='Felix' id='Felix'>,\n",
       " <Record labels=['Person'] name='Lee Know' id='http://www.wikidata.org/entity/Q59260597'>,\n",
       " <Record labels=['Location'] name='Japan' id='http://www.wikidata.org/entity/Q17'>]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_cypher(\"MATCH (n) RETURN labels(n) as labels, n.name as name, n.id as id LIMIT 25\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "9cf5ae3d",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record pLabels=['Organization'] pName='Stray Kids' rel='ORGANIZATION_LOCATIONS' oLabels=['Location'] oName='Japan'>,\n",
       " <Record pLabels=['Organization'] pName='Stray Kids' rel='FOUNDED_BY' oLabels=['Person'] oName='Bang Chan'>,\n",
       " <Record pLabels=['Organization'] pName='Stray Kids' rel='EMPLOYEE_OR_MEMBER_OF' oLabels=['Person'] oName='Woojin'>,\n",
       " <Record pLabels=['Organization'] pName='Stray Kids' rel='EMPLOYEE_OR_MEMBER_OF' oLabels=['Person'] oName='Bang Chan'>]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_cypher(\"\"\"\n",
    "MATCH (p)\n",
    "WHERE (p.name IS NOT NULL AND toLower(p.name) CONTAINS toLower($name))\n",
    "   OR (p.id   IS NOT NULL AND toLower(p.id)   CONTAINS toLower($name))\n",
    "WITH p LIMIT 5\n",
    "MATCH (p)-[r]-(o)\n",
    "RETURN labels(p) AS pLabels, p.name AS pName,\n",
    "       type(r) AS rel, labels(o) AS oLabels, o.name AS oName\n",
    "LIMIT 50\n",
    "\"\"\", {\"name\": \"Stray Kids\"})\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "7b921cc3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record name='Stray Kids' labels=['Organization'] id='http://www.wikidata.org/entity/Q46134670' degree=4>]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "run_cypher(\"\"\"\n",
    "MATCH (p)\n",
    "WHERE p.name IS NOT NULL AND toLower(p.name) CONTAINS toLower($name)\n",
    "WITH p, COUNT {(p)--()} AS degree\n",
    "RETURN p.name AS name, labels(p) AS labels, p.id AS id, degree\n",
    "ORDER BY degree DESC\n",
    "LIMIT 10\n",
    "\"\"\", {\"name\":\"Stray Kids\"})\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1eeebe59",
   "metadata": {},
   "source": [
    "## Function to get all relationships for an entity"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "3c9a654a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record person='Stray Kids' personLabels=['Organization'] rel='ORGANIZATION_LOCATIONS' other='Japan' otherLabels=['Location'] relProps={'evidence': 'Stray Kids debuted in Japan with the Japanese version of \"Levanter\", \"Double Knot\", and \"My Pace\", as well as the re-recorded version of their songs from the previous album compiled in the compilation album SKZ2020.'} otherProps={'id': 'http://www.wikidata.org/entity/Q17', 'name': 'Japan'}>,\n",
       " <Record person='Stray Kids' personLabels=['Organization'] rel='FOUNDED_BY' other='Bang Chan' otherLabels=['Person'] relProps={'evidence': \"It was later revealed that the Stray Kids' member line-up was formed unusually, with the leader Bang Chan handpicking each member from the list of JYPE trainees rather than the agency's executives and creative directors selecting them.\"} otherProps={'id': 'http://www.wikidata.org/entity/Q59670293', 'name': 'Bang Chan'}>,\n",
       " <Record person='Stray Kids' personLabels=['Organization'] rel='EMPLOYEE_OR_MEMBER_OF' other='Woojin' otherLabels=['Person'] relProps={'evidence': 'Stray Kids primarily self-produces its recordings; the main production team is named 3Racha and consists of Bang Chan, Changbin, and Han, and the other members frequently participate in songwriting.', 'isCurrent': 'true'} otherProps={'id': 'Woojin', 'name': 'Woojin'}>]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_person_relationships(person_name: str, limit_nodes: int = 1, limit_edges: int = 200):\n",
    "    q = \"\"\"\n",
    "    MATCH (p)\n",
    "    WHERE (p.name IS NOT NULL AND toLower(p.name) CONTAINS toLower($name))\n",
    "    WITH p, COUNT {(p)--()} AS degree\n",
    "    ORDER BY degree DESC\n",
    "    LIMIT $limit_nodes\n",
    "    MATCH (p)-[r]-(o)\n",
    "    RETURN p.name AS person, labels(p) AS personLabels,\n",
    "           type(r) AS rel, o.name AS other, labels(o) AS otherLabels,\n",
    "           properties(r) AS relProps, properties(o) AS otherProps\n",
    "    LIMIT $limit_edges\n",
    "    \"\"\"\n",
    "    return run_cypher(q, {\"name\": person_name, \"limit_nodes\": limit_nodes, \"limit_edges\": limit_edges})\n",
    "\n",
    "rows = get_person_relationships(\"Stray Kids\")\n",
    "rows[:3]\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d34e67e4",
   "metadata": {},
   "source": [
    "## Ollama"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e41c3752",
   "metadata": {},
   "source": [
    "### Setting up the model"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "292fa7d2",
   "metadata": {},
   "source": [
    "Create the llm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "c7c4e991",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/var/folders/qm/m2j4gyxn6d3dvqq5n3d91kxr0000gn/T/ipykernel_72641/2864514228.py:3: LangChainDeprecationWarning: The class `ChatOllama` was deprecated in LangChain 0.3.1 and will be removed in 1.0.0. An updated version of the class exists in the `langchain-ollama package and should be used instead. To use it run `pip install -U `langchain-ollama` and import as `from `langchain_ollama import ChatOllama``.\n",
      "  llm = ChatOllama(\n"
     ]
    }
   ],
   "source": [
    "from langchain_community.chat_models import ChatOllama\n",
    "\n",
    "llm = ChatOllama(\n",
    "    model=OLLAMA_MODEL,\n",
    "    base_url=OLLAMA_BASE_URL,\n",
    "    temperature=0\n",
    ")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e43ff112",
   "metadata": {},
   "source": [
    "Write the cypher prompt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "71bbd715",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['chains',\n",
       " 'chat_message_histories',\n",
       " 'graphs',\n",
       " 'query_constructors',\n",
       " 'vectorstores']"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import langchain_neo4j, pkgutil\n",
    "[c.name for c in pkgutil.iter_modules(langchain_neo4j.__path__)]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "9c0cdfd7",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_community.graphs import Neo4jGraph as ClassicNeo4jGraph\n",
    "from langchain_core.prompts import PromptTemplate\n",
    "from langchain_classic.chains import GraphCypherQAChain\n",
    "from langchain_core.prompts import PromptTemplate\n",
    "\n",
    "CYPHER_PROMPT = PromptTemplate.from_template(\"\"\"\n",
    "You are a Neo4j Cypher expert.\n",
    "\n",
    "Rules:\n",
    "- Use ONLY the schema below.\n",
    "- Always match entities using the `name` property.\n",
    "- type(r) is ONLY for relationships.\n",
    "- labels(n) is ONLY for nodes.\n",
    "- Never call type() on a node.\n",
    "- Prefer exact match when the name is known.\n",
    "\n",
    "Schema:\n",
    "{schema}\n",
    "\n",
    "Question:\n",
    "{question}\n",
    "\n",
    "Cypher query:\n",
    "\"\"\")\n",
    "\n",
    "\n",
    "qa_chain = GraphCypherQAChain.from_llm(\n",
    "    llm=llm,\n",
    "    graph=classic_graph,\n",
    "    cypher_prompt=CYPHER_PROMPT,\n",
    "    verbose=True,\n",
    "    allow_dangerous_requests=True,\n",
    "    validate_cypher=True,\n",
    "    top_k=20\n",
    ")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2f03fe2d",
   "metadata": {},
   "source": [
    "Useful function in our case"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "65c12592",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "MATCH (n:Person {name: \"Stray Kids\"})-[:EMPLOYEE_OR_MEMBER_OF]-(o:Organization)\n",
      "OPTIONAL MATCH (o)-[:ORGANIZATION_LOCATIONS]-(loc:Location)\n",
      "RETURN o, loc\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Cypher:\n",
      " <no cypher returned>\n",
      "\n",
      "Raw result keys: ['query', 'result']\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "\"I don't know the answer.\""
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def ask_graph(question: str, debug: bool = True) -> str:\n",
    "    out = qa_chain.invoke({\"query\": question})\n",
    "    if debug:\n",
    "        print(\"Cypher:\\n\", out.get(\"cypher\", \"<no cypher returned>\"))\n",
    "        print(\"\\nRaw result keys:\", list(out.keys()))\n",
    "    return out.get(\"result\", out)\n",
    "\n",
    "\n",
    "ask_graph(\"What are the main entities connected to Stray Kids?\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "20ad6081",
   "metadata": {},
   "source": [
    "### Subgraph retrieval"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "6501c596",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_entity_subgraph(entity_name: str, hops: int = 1, limit_edges: int = 120):\n",
    "    # 1-hop neighborhood (simple + reliable)\n",
    "    q = \"\"\"\n",
    "    MATCH (p)\n",
    "    WHERE p.name IS NOT NULL AND toLower(p.name) CONTAINS toLower($name)\n",
    "    WITH p, COUNT{(p)--()} AS degree\n",
    "    ORDER BY degree DESC\n",
    "    LIMIT 1\n",
    "    MATCH (p)-[r]-(o)\n",
    "    RETURN p.name AS center,\n",
    "           type(r) AS rel,\n",
    "           coalesce(o.name, o.id, 'UNKNOWN') AS neighbor,\n",
    "           labels(o) AS neighborLabels,\n",
    "           properties(r) AS relProps\n",
    "    LIMIT $limit_edges\n",
    "    \"\"\"\n",
    "    return run_cypher(q, {\"name\": entity_name, \"limit_edges\": limit_edges})\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "5a85b61f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Here are 7 bullet points summarizing Stray Kids based on the provided Neo4j graph evidence:\n",
      "\n",
      "• Stray Kids debuted in Japan with the Japanese versions of \"Levanter\", \"Double Knot\", and \"My Pace\", as well as a compilation album SKZ2020.\n",
      "• The group was founded by Bang Chan, who handpicked each member from JYPE trainees rather than agency executives and creative directors selecting them.\n",
      "• Stray Kids is primarily self-producing, with the main production team being 3Racha, consisting of Bang Chan, Changbin, and Han.\n",
      "• Other members frequently participate in songwriting for the group's recordings.\n",
      "• Woojin is a member of Stray Kids.\n",
      "• Bang Chan is a member of Stray Kids and also the founder of the group.\n",
      "• The location where Stray Kids debuted is Japan.\n"
     ]
    }
   ],
   "source": [
    "from langchain_core.messages import HumanMessage\n",
    "\n",
    "def summarize_entity(entity_name: str):\n",
    "    edges = get_entity_subgraph(entity_name)\n",
    "    # Convert to compact bullet evidence\n",
    "    evidence = []\n",
    "    for e in edges:\n",
    "        evidence.append(f\"- ({e['center']}) -[:{e['rel']}]-> ({e['neighborLabels']} {e['neighbor']}) props={e['relProps']}\")\n",
    "    evidence_text = \"\\n\".join(evidence[:80])  # keep prompt small-ish\n",
    "\n",
    "    prompt = f\"\"\"\n",
    "You are summarizing an entity using ONLY the evidence below from a Neo4j graph.\n",
    "If a fact (especially dates/numbers) is not explicitly present in evidence, say \"not present in the graph evidence\".\n",
    "Do not add outside knowledge.\n",
    "Write 6-10 bullet points.\n",
    "\n",
    "Entity: {entity_name}\n",
    "\n",
    "Evidence:\n",
    "{evidence_text}\n",
    "\"\"\"\n",
    "    resp = llm.invoke([HumanMessage(content=prompt)])\n",
    "    return resp.content\n",
    "\n",
    "print(summarize_entity(\"Stray Kids\"))\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cf373b75",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "graphito",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
